# Data Cleaning and preperations

- Handiling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([3, 4, 5, np.nan, None])  #Built in none value in python treated as nan

In [3]:
data.isna()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [4]:
data = pd.Series([4, 6, 7, 4, None, np.nan], dtype='float64')

In [5]:
data

0    4.0
1    6.0
2    7.0
3    4.0
4    NaN
5    NaN
dtype: float64

1. dropna = remove null values in data
2. isna = return true if value is null
3. fillna = Fill the missing values in data
4. notna = return true if value is not null

In [6]:
data = pd.Series([3, 5, 4.6, 23, np.nan, 34.5, np.nan])

In [7]:
data.dropna()

0     3.0
1     5.0
2     4.6
3    23.0
5    34.5
dtype: float64

In [8]:
#The same thing as doing
data[data.notna()]

0     3.0
1     5.0
2     4.6
3    23.0
5    34.5
dtype: float64

In [9]:
data = pd.DataFrame([[2, 3, 5], [2, np.nan, np.nan], [None, None, None], [None, 3, 5]])

In [10]:
data

     0    1    2
0  2.0  3.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  5.0

In [11]:
data.dropna()   #Remove all null contains row

     0    1    2
0  2.0  3.0  5.0

In [12]:
data.dropna(how="all")  #remove only all containing non null row

     0    1    2
0  2.0  3.0  5.0
1  2.0  NaN  NaN
3  NaN  3.0  5.0

In [13]:
data.dropna(axis="columns", how="all")

     0    1    2
0  2.0  3.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  5.0

# Filling the data

In [14]:
data

     0    1    2
0  2.0  3.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  5.0

In [15]:
data.fillna(data.mean())

     0    1    2
0  2.0  3.0  5.0
1  2.0  3.0  5.0
2  2.0  3.0  5.0
3  2.0  3.0  5.0

In [16]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [17]:
df.iloc[2:, 1] = np.nan

In [18]:
df

          0         1         2
0 -0.399864  0.520677  0.470554
1  0.997807  0.625883  1.396568
2 -1.325168       NaN -1.040192
3 -0.924740       NaN  0.254039
4  0.742223       NaN  0.124606
5  0.278560       NaN  0.132749

In [19]:
df.fillna(method="ffill")

/tmp/ipykernel_2254/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -0.399864  0.520677  0.470554
1  0.997807  0.625883  1.396568
2 -1.325168  0.625883 -1.040192
3 -0.924740  0.625883  0.254039
4  0.742223  0.625883  0.124606
5  0.278560  0.625883  0.132749

In [20]:
df.fillna(method="ffill", limit=2)

/tmp/ipykernel_2254/1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -0.399864  0.520677  0.470554
1  0.997807  0.625883  1.396568
2 -1.325168  0.625883 -1.040192
3 -0.924740  0.625883  0.254039
4  0.742223       NaN  0.124606
5  0.278560       NaN  0.132749

# Data Transfomation

In [21]:
#Remove duplicates
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})

In [22]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data["v1"] = range(7)

In [26]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [27]:
# Transforming data using a Function or Mapping

In [28]:
data = pd.DataFrame({'Food':["rice", "Dal", "razma", "nan"], 'place':["meerut", "Delhi", "rampur", "haridwar"]})

In [29]:
data

    Food     place
0   rice    meerut
1    Dal     Delhi
2  razma    rampur
3    nan  haridwar

In [30]:
price = {"meerut": 500, "Delhi":400,"meerut":299, "haridwar":599, "rampur":200}

In [31]:
data["price"] = data["place"].map(price)

In [32]:
data

    Food     place  price
0   rice    meerut    299
1    Dal     Delhi    400
2  razma    rampur    200
3    nan  haridwar    599

In [33]:
def get_price(x):
    return price[x]
data["place"].map(get_price)

0    299
1    400
2    200
3    599
Name: place, dtype: int64

In [34]:
#Replacing the values
data = pd.Series([2, 4, 5, 3, 33])
data.replace(4, np.nan)

0     2.0
1     NaN
2     5.0
3     3.0
4    33.0
dtype: float64

In [35]:
data.replace({4:np.nan, 5:"he"})

0     2.0
1     NaN
2      he
3     3.0
4    33.0
dtype: object

In [36]:
#Renaming Access of index
data = pd.DataFrame(np.arange(12).reshape((3,4)), index=["ohio", "johio", "morina"], columns=["one", "two", "three", "four"])

In [37]:
data

        one  two  three  four
ohio      0    1      2     3
johio     4    5      6     7
morina    8    9     10    11

In [38]:
def function(x):
    return x.upper()
data.index.map(function)

Index(['OHIO', 'JOHIO', 'MORINA'], dtype='object')

In [39]:
data.rename(index = str.title, columns = str.upper)

        ONE  TWO  THREE  FOUR
Ohio      0    1      2     3
Johio     4    5      6     7
Morina    8    9     10    11

In [40]:
data.rename({"ohio":"India", "johio": "loio"})

        one  two  three  four
India     0    1      2     3
loio      4    5      6     7
morina    8    9     10    11

In [41]:
#Descritiziation and Binning
age = [3, 4, 5, 6, 7, 23, 45 ,67, 7, 8, 34, 56]
bins = [3, 4]
binning = pd.cut(age, bins)

In [42]:
binning

[NaN, (3.0, 4.0], NaN, NaN, NaN, ..., NaN, NaN, NaN, NaN, NaN]
Length: 12
Categories (1, interval[int64, right]): [(3, 4]]

In [43]:
#Detecting and filtering the outliers

In [44]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [45]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027922    -0.001938    -0.032001    -0.041361
std       0.981519     0.976672     0.980851     1.049768
min      -3.368182    -2.884034    -2.954651    -2.972974
25%      -0.657190    -0.675466    -0.649457    -0.776707
50%      -0.008455     0.002426    -0.017502    -0.046584
75%       0.617011     0.682779     0.591929     0.649071
max       2.667316     2.999298     3.114337     3.954744

In [46]:
col = data[2]

In [47]:
col

0      0.927457
1     -2.231216
2     -1.499927
3      0.250657
4      1.579487
         ...
995   -0.571331
996   -1.197550
997    1.614487
998   -0.005611
999    1.067234
Name: 2, Length: 1000, dtype: float64

In [48]:
col[col.abs()>3]

13    3.114337
Name: 2, dtype: float64

In [49]:
data[(data.abs()>3).any(axis="columns")]

            0         1         2         3
0   -3.368182  2.313165  0.927457 -0.125260
13  -1.075598 -2.084152  3.114337 -0.707554
184 -3.080255 -0.174381 -1.084075  0.875034
326 -0.717345  1.006656 -0.167408  3.954744
753  0.523777 -0.325690 -1.403183  3.024590
786 -0.314867 -1.782536  0.743739  3.112323

In [50]:
data[data.abs() > 3] = np.sign(data) * 3

In [51]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027474    -0.001938    -0.032115    -0.042453
std       0.980087     0.976672     0.980490     1.046155
min      -3.000000    -2.884034    -2.954651    -2.972974
25%      -0.657190    -0.675466    -0.649457    -0.776707
50%      -0.008455     0.002426    -0.017502    -0.046584
75%       0.617011     0.682779     0.591929     0.649071
max       2.667316     2.999298     3.000000     3.000000

In [52]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0 -1.0

In [53]:
#permutations
sam = pd.DataFrame(np.arange(4*3).reshape((3,4)))

In [54]:
sample = np.random.permutation(3)

In [55]:
sample

array([2, 1, 0])

In [56]:
sam.take(sample) #also used iloc function sam.iloc(sample)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [57]:
sample = np.random.permutation(4)

In [58]:
sam.take(sample, axis = 'columns')

    2  1   3  0
0   2  1   3  0
1   6  5   7  4
2  10  9  11  8

In [59]:
# sample is used to create a smaple according to the data
sam.sample(5, replace=True)   # replace is used to generate extra data

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
0  0  1   2   3
2  8  9  10  11
0  0  1   2   3

# Computing indicator and dummy variable

In [60]:
df = pd.DataFrame({"key":['a', 'b', 'c', 'd', 'e', 'f'], "value":np.arange(6)})

In [61]:
df

  key  value
0   a      0
1   b      1
2   c      2
3   d      3
4   e      4
5   f      5

In [62]:
pd.get_dummies(df["key"], prefix="key")

   key_a  key_b  key_c  key_d  key_e  key_f
0   True  False  False  False  False  False
1  False   True  False  False  False  False
2  False  False   True  False  False  False
3  False  False  False   True  False  False
4  False  False  False  False   True  False
5  False  False  False  False  False   True

In [63]:
df[['value']].join(pd.get_dummies(df["key"], prefix="key"))

   value  key_a  key_b  key_c  key_d  key_e  key_f
0      0   True  False  False  False  False  False
1      1  False   True  False  False  False  False
2      2  False  False   True  False  False  False
3      3  False  False  False   True  False  False
4      4  False  False  False  False   True  False
5      5  False  False  False  False  False   True

# string manipulation

In [64]:
val = "a good boy"
val.split(" ")   #return a list of string seprated by a space

['a', 'good', 'boy']

In [65]:
piece = [x.strip() for x in val.split(" ")]

In [66]:
piece

['a', 'good', 'boy']

In [67]:
first,second,third = piece

In [68]:
print(first+"::"+second+"::"+third)

a::good::boy

In [69]:
"::".join(piece)

'a::good::boy'

In [70]:
val

'a good boy'

In [71]:
'boy' in val

True

In [72]:
val.index(" ")  #show error if not present a substring

1

In [73]:
val.find(",")

-1

In [74]:
val.count("o")

3

In [75]:
val.replace("o", "0")

'a g00d b0y'

# Regular expresion

- Regular expression provide flexible way to search or match string pattern in text

In [76]:
#re module is used to find pattern matching ,substitution and splliting

In [77]:
import re

In [78]:
#\s+ one or more white space charachter

In [79]:
text = " hey whatsupp\t what \tare you doing"

In [80]:
re.split(r"\s+", text)

['', 'hey', 'whatsupp', 'what', 'are', 'you', 'doing']

In [81]:
regex = re.compile(r"\s+")  #we create because of use this

In [82]:
regex.split(text)

['', 'hey', 'whatsupp', 'what', 'are', 'you', 'doing']

In [83]:
regex.findall(text)

[' ', ' ', '\t ', ' \t', ' ', ' ']

In [84]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+.[A-Z]{2,4}"

In [85]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [86]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [87]:
print(regex.match(text))  #regex.match returns None, as it will match only if the pattern occurs at the start of the string

None

In [88]:
print(regex.sub("REDACTED", text))  #Relatedly, sub will return a new string with occurrences of the pattern replaced by a new string

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [89]:
# String function in pandas

In [90]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com","Rob": "rob@gmail.com", "Wes": np.nan}

In [91]:
data = pd.Series(data)

In [92]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [93]:
datas = data.astype("string")

In [94]:
datas

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [95]:
datas.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [98]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [109]:
datas.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                       <NA>
dtype: object

In [110]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [111]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

# Categorial extension in pandas

In [112]:
fruits = ['apple', 'orange', 'grapes', 'orange', 'apple']*2

In [113]:
N = len(fruits)

In [122]:
rng = np.random.default_rng(seed=12345)

In [125]:
df = pd.DataFrame({'fruit': fruits,'basket_id': np.arange(N),'count': rng.integers(3, 15, size=N),'weight': rng.uniform(0, 4, size=N)},columns=['basket_id', 'fruit', 'count', 'weight'])

In [126]:
df

   basket_id   fruit  count    weight
0          0   apple     11  3.545920
1          1  orange      5  2.789814
2          2  grapes     13  1.305891
3          3  orange     14  2.935713
4          4   apple     11  0.880540
5          5   apple     11  0.326378
6          6  orange      4  0.639582
7          7  grapes      4  1.360401
8          8  orange      6  1.860773
9          9   apple      8  1.065684

In [127]:
fruit_cat = df['fruit'].astype('category')

In [128]:
fruit_cat

0     apple
1    orange
2    grapes
3    orange
4     apple
5     apple
6    orange
7    grapes
8    orange
9     apple
Name: fruit, dtype: category
Categories (3, object): ['apple', 'grapes', 'orange']

In [131]:
#it contains code
fruit_cat.array.codes

array([0, 2, 1, 2, 0, 0, 2, 1, 2, 0], dtype=int8)

In [132]:
c = fruit_cat.array

In [133]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'grapes', 2: 'orange'}

In [134]:
pd.Categorical(['ap', 'ap', 'gap', 'gap']) #we can also create a categorial with the help of this

['ap', 'ap', 'gap', 'gap']
Categories (2, object): ['ap', 'gap']

In [135]:
categories = ['app', 'gap', 'lap']
codes = [0, 0, 1, 2, 1, 2, 0, 2, 1]

In [136]:
pd.Categorical.from_codes(codes, categories)

['app', 'app', 'gap', 'lap', 'gap', 'lap', 'app', 'lap', 'gap']
Categories (3, object): ['app', 'gap', 'lap']